src/cf/src/Reports/МатериалыНаСтанках/МатериалыНаСтанках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>МатериалыНаСтанках</name>
</mdclass:Report>

src/cf/src/AccumulationRegisters/МатериалыНаСтанках/МатериалыНаСтанках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МатериалыНаСтанках</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтрокиПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Требование</name>
    <type>
      <types>DocumentRef.ТребованиеНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ТребованиеНакладная/ТребованиеНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТребованиеНакладная</name>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.МатериалыНаСтанках</registerRecords>
  <registerRecords>InformationRegister.ЗагрузкаСтанков</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтрокиПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТребованийНакладных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьВручную</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФакт</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалыОставлены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьПриРазмещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СоСкладаСтанка</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Израсходовано</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/ПроизводственноеОборудование/ПроизводственноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроизводственноеОборудование</name>
  <attributes>
    <name>ВидСтанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаСменуЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладСтанка</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Выведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаетБезКалендаря</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботы</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Круглосуточно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыработкаПоНоменклатуре</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Выработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Reports/МатериалыНаСтанках/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Данные отчёта «Материалы на станках» одной таблицей - внешний набор «Материалы» схемы: на конец дня даты
// закреплённое за требованиями (регистр «Материалы на станках») и свободный остаток станка - остаток склада станка
// за вычетом закреплённого (сборка 2, P1-N1). Кг - по весу номенклатуры, себестоимость - по средней себестоимости
// остатка склада станка без НДС, с дополнительными расходами (как у выпуска). Отчёт и тест зовут эту функцию одинаково.
//
// Параметры:
//  НаДату - Дата - дата отчёта: остатки на её конец
//
// Возвращаемое значение:
//  Структура:
//   * Материалы      - ТаблицаЗначений - колонки полей набора схемы
//   * Предупреждение - Строка - закреплённое без остатка на складе станка (себестоимость 0); пустая - расхождений нет
//
Функция ДанныеОтчета(НаДату) Экспорт

	Граница = Новый Граница(КонецДня(НаДату), ВидГраницы.Включая);
	Пакет = ОстаткиНаСтанках(Граница);
	Закреплено = Пакет.Закреплено;
	Склад = Пакет.Склад;

	Материалы = НоваяТаблицаДанных();
	Ключи = "Станок, Материал, ХарактеристикаМатериала";
	ШаблонЗаказа = НСтр("ru = 'Заказ %1, %2'; fr = 'Commande %1, %2'; en = 'Order %1, %2'; es = 'Pedido %1, %2'");
	Для Каждого Остаток Из Закреплено Цикл
		Строка = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Остаток);
		Строка.Назначение = СтрШаблон(ШаблонЗаказа, СокрЛП(Остаток.НомерЗаказа), Остаток.Продукция);
	КонецЦикла;
	Свободный = НСтр("ru = 'Свободный остаток станка'; fr = 'Stock libre de la machine'; en = 'Free machine stock';
		|es = 'Stock libre de la máquina'");
	Для Каждого Остаток Из Склад Цикл
		Отбор = Новый Структура(Ключи);
		ЗаполнитьЗначенияСвойств(Отбор, Остаток);
		СвободноеКоличество = Остаток.Количество;
		Для Каждого СтрокаЗакрепления Из Закреплено.НайтиСтроки(Отбор) Цикл
			СвободноеКоличество = СвободноеКоличество - СтрокаЗакрепления.Количество;
		КонецЦикла;
		// Отрицательный свободный остаток не прячется: промежуточные моменты истории склада станка не сверяются
		// (TECHDEBT сборки 2), отчёт показывает расхождение как есть.
		Если СвободноеКоличество <> 0 Тогда
			Строка = Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Остаток, Ключи);
			Строка.Назначение = Свободный;
			Строка.Количество = СвободноеКоличество;
		КонецЕсли;
	КонецЦикла;

	БезОстатка = Новый Массив;
	Коэффициенты = ЗагрузкаСтанков.КгНаЕдиницу(Материалы.ВыгрузитьКолонку("Материал"));
	Для Каждого Строка Из Материалы Цикл
		Коэффициент = Коэффициенты.Получить(Строка.Материал);
		Строка.Кг = ?(ЗначениеЗаполнено(Коэффициент), Строка.Количество * Коэффициент, 0);
		Отбор = Новый Структура(Ключи);
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		НаСкладе = Склад.НайтиСтроки(Отбор);
		ЕстьОстаток = НаСкладе.Количество() > 0 И НаСкладе[0].Количество <> 0;
		Если ЕстьОстаток Тогда
			Строка.Сумма = Окр(НаСкладе[0].Сумма / НаСкладе[0].Количество * Строка.Количество, ЗнаковСуммы());
		КонецЕсли;
		Если Не ЕстьОстаток И БезОстатка.Найти(Строка.Материал) = Неопределено Тогда
			БезОстатка.Добавить(Строка.Материал);
		КонецЕсли;
	КонецЦикла;
	Возврат Новый Структура("Материалы, Предупреждение", Материалы, ТекстБезОстатка(БезОстатка));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Остатки склада станков и закреплённого на границу.
//
// Параметры:
//  Граница - Граница - конец дня отчёта включительно
//
// Возвращаемое значение:
//  Структура:
//   * Закреплено - ТаблицаЗначений - Станок, Требование, Заказ, НомерЗаказа, Продукция, Материал,
//                  ХарактеристикаМатериала, Количество
//   * Склад      - ТаблицаЗначений - Станок, Материал, ХарактеристикаМатериала, Количество, Сумма (без НДС, с доп.
//                  расходами)
//
Функция ОстаткиНаСтанках(Граница)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Станки.Ссылка КАК Станок,
	|	Станки.СкладСтанка КАК Склад
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.ПроизводственноеОборудование КАК Станки
	|ГДЕ
	|	Станки.СкладСтанка <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Станок КАК Станок,
	|	Остатки.Требование КАК Требование,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВТЗакреплено
	|ИЗ
	|	РегистрНакопления.МатериалыНаСтанках.Остатки(
	|			&Граница,
	|			Станок В
	|				(ВЫБРАТЬ
	|					ВТСклады.Станок КАК Станок
	|				ИЗ
	|					ВТСклады КАК ВТСклады)) КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗакреплено.Станок КАК Станок,
	|	ВТЗакреплено.Требование КАК Требование,
	|	Требования.Заказ КАК Заказ,
	|	ЕСТЬNULL(Заказы.Номер, """") КАК НомерЗаказа,
	|	Требования.Номенклатура КАК Продукция,
	|	ВТЗакреплено.Номенклатура КАК Материал,
	|	ВТЗакреплено.Характеристика КАК ХарактеристикаМатериала,
	|	ВТЗакреплено.Количество КАК Количество
	|ИЗ
	|	ВТЗакреплено КАК ВТЗакреплено
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТребованиеНакладная КАК Требования
	|		ПО ВТЗакреплено.Требование = Требования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Заказы
	|		ПО (Требования.Заказ = Заказы.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.МестоХранения КАК МестоХранения,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.КоличествоОстаток КАК Количество,
	|	Товары.СуммаОстаток - Товары.СуммаНДСОстаток КАК Сумма
	|ПОМЕСТИТЬ ВТОстаткиСклада
	|ИЗ
	|	РегистрНакопления.ТоварыВНаличии.Остатки(
	|			&Граница,
	|			МестоХранения В
	|				(ВЫБРАТЬ
	|					ВТСклады.Склад КАК Склад
	|				ИЗ
	|					ВТСклады КАК ВТСклады)) КАК Товары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расходы.МестоХранения,
	|	Расходы.Номенклатура,
	|	Расходы.Характеристика,
	|	0,
	|	Расходы.СуммаОстаток - Расходы.СуммаНДСОстаток
	|ИЗ
	|	РегистрНакопления.ДополнительныеРасходы.Остатки(
	|			&Граница,
	|			МестоХранения В
	|				(ВЫБРАТЬ
	|					ВТСклады.Склад КАК Склад
	|				ИЗ
	|					ВТСклады КАК ВТСклады)) КАК Расходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСклады.Станок КАК Станок,
	|	ВТОстаткиСклада.Номенклатура КАК Материал,
	|	ВТОстаткиСклада.Характеристика КАК ХарактеристикаМатериала,
	|	СУММА(ВТОстаткиСклада.Количество) КАК Количество,
	|	СУММА(ВТОстаткиСклада.Сумма) КАК Сумма
	|ИЗ
	|	ВТОстаткиСклада КАК ВТОстаткиСклада
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
	|		ПО ВТОстаткиСклада.МестоХранения = ВТСклады.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСклады.Станок,
	|	ВТОстаткиСклада.Номенклатура,
	|	ВТОстаткиСклада.Характеристика";
	Запрос.УстановитьПараметр("Граница", Граница);
	Пакет = Запрос.ВыполнитьПакет();
	Возврат Новый Структура("Закреплено, Склад", Пакет[ИндексЗакрепленного()].Выгрузить(),
		Пакет[Пакет.ВГраница()].Выгрузить());

КонецФункции

// Предупреждение о материалах, закреплённых за требованиями без остатка на складе станка: их себестоимость 0.
//
// Параметры:
//  БезОстатка - Массив из СправочникСсылка.Номенклатура - материалы
//
// Возвращаемое значение:
//  Строка - текст; пустая - расхождений нет
//
Функция ТекстБезОстатка(БезОстатка)

	Если БезОстатка.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	Представления = Новый Массив;
	Для Каждого Материал Из БезОстатка Цикл
		Представления.Добавить(Строка(Материал));
	КонецЦикла;
	Шаблон = НСтр("ru = 'Закреплено за требованиями, но нет на складе станка (себестоимость 0): %1';
		|fr = 'Réservé par des bons mais absent de l''entrepôt de la machine (coût 0) : %1';
		|en = 'Reserved by requisitions but missing from the machine warehouse (cost 0): %1';
		|es = 'Reservado por vales pero ausente del almacén de la máquina (coste 0): %1'");
	Возврат СтрШаблон(Шаблон, СтрСоединить(Представления, ", "));

КонецФункции

Функция ИндексЗакрепленного()

	Возврат 2;

КонецФункции

Функция ЗнаковСуммы()

	Возврат 2;

КонецФункции

Функция НоваяТаблицаДанных()

	ТипЧисла = Новый ОписаниеТипов("Число");
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Станок", Новый ОписаниеТипов("СправочникСсылка.ПроизводственноеОборудование"));
	Таблица.Колонки.Добавить("Назначение", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	Таблица.Колонки.Добавить("Продукция", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Требование", Новый ОписаниеТипов("ДокументСсылка.ТребованиеНакладная"));
	Таблица.Колонки.Добавить("Материал", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("ХарактеристикаМатериала", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Для Каждого Имя Из СтрРазделить("Количество,Кг,Сумма", ",") Цикл
		Таблица.Колонки.Добавить(Имя, ТипЧисла);
	КонецЦикла;
	Возврат Таблица;

КонецФункции

#КонецОбласти
